# coding=gb2312

import Conf

# 省市名字列表，用于excel导出报表中内容的显示。excel中显示内容需求与数据库中不一致
# 如数据库中存储的阿坝藏族羌族自治州，excel中显示阿坝州
zoneDic = ({
                51000000: '四川',
                51010000: '成都',
                51030000: '自贡',
                51040000: '攀枝花',
                51050000: '泸州',
                51060000: '德阳',
                51070000: '绵阳',
                51080000: '广元',
                51090000: '遂宁',
                51100000: '内江',
                51110000: '乐山',
                51130000: '南充',
                51140000: '眉山',
                51150000: '宜宾',
                51160000: '广安',
                51170000: '达州',
                51180000: '雅安',
                51190000: '巴中',
                51200000: '资阳',
                51320000: '阿坝',
                51330000: '甘孜',
                51340000: '凉山'
                })

# 全省卫星定位系统车辆动态统计报表中表头所占行数
headerLineNumber = 6

# 运行环境的字符编码
envEncode = 'gbk'

# 地图解析经纬度一次解析的数量，必须小于400且为偶数。偶数是因为一半是起点坐标，一半是终点坐标
posBlockSize = 400
   
# 地图引擎服务器
# GPS_Gov数据库用户账号
# GPS_Gov数据库用户密码

if(Conf.isProdEnv):
    mapEngineAddress = ('192.168.100.204', 732)
    gpsGovUID = 'webgov'
    gpsGovPWD = '1*fl@1,G-0,F'
else:
    mapEngineAddress = ('192.168.18.227', 7777)
    gpsGovUID = 'sa'
    gpsGovPWD = '123@abc'



